<?php
    $con=mysqli_connect("localhost", "root", "0630", "sales_management") or die("MySQL 접속 실패");
    echo "MYSQL 접속 완전히 성공!!"."<br>";

    $sql = "INSERT INTO `직급` VALUES
    ('S001', '1111', '홍길동', 'A', '01011111111', 'hgd1111@naver.com', '서울시', '1', '1001', 'S001', '2022-01-15', NULL),
    ('S002', '2222', '김철수', 'B', '01022222222', 'kcs2222@gmail.com', '인천시', '2', '1001', 'S001', '2022-02-08', NULL),
    ('S003', '3333', '안영희', 'C', '01033333333', 'ayh3333@naver.com', '대전시', '3', '1001', 'S001', '2022-03-11', NULL),
    ('S004', '4444', '최진호', 'A', '01044444444', 'cjh4444@gmail.com', '세종시', '4', '1002', 'S002', '2022-04-22', '2022-11-24'),
    ('S005', '5555', '이서영', 'B', '01055555555', 'lsy5555@hanmail.net', '광주시', '5', '1002', 'S002', '2022-05-02', NULL),
    ('S006', '6666', '유지혜', 'B', '01066666666', 'yjh6666@gmail.com', '제주시', '6', '1002', 'S003', '2022-06-19', NULL),
    ('S007', '7777', '박소양', 'C', '01077777777', 'bsy7777@naver.com', '대구시', '7', '1003', 'S003', '2022-07-31', NULL),
    ('S008', '8888', '이종수', 'B', '01088888888', 'ljs8888@naver.com', '울산시', '8', '1003', 'S003', '2022-08-01', NULL),
    ('S009', '9999', '서은지', 'A', '01099999999', 'sej9999@gmail.com', '부산시', '9', '1003', 'S008', '2022-09-13', NULL),
    ('S010', '1010', '김지훈', 'C', '01010101010', 'kjh1010@hanmail.net', '경산시', '10', '1003', 'S008', '2022-10-10', '2022-11-03')
    ";
    $ret = mysqli_query($con, $sql);

    if($ret) {
        echo "데이터가 성공적으로 입력됨.";
    }
    else {
        echo "입력 실패!!"."<br>";
        echo "실패 원인: ".mysqli_error($con);
    }

    mysqli_close($con);
?>